In [517]:
import pandas as pd
from datetime import datetime, timedelta

In [518]:
# using pandas to read dataset from csv file
zulo_bank = pd.read_csv('zulo_bank_dataset.csv')
# displaying the first five 
zulo_bank.head()

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,NaN,NaN,NaN,NaN
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03

In [519]:
# check the data info
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1278 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1278 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

In [520]:
# the data has 1554 rows, and some columns have NULL value. 
# Those missing values have to be filled up with the appropriate parameters

zulo_bank.fillna({
    'loanAmount': 0.0,
    'LoanType': 'unknown',
    'InterestRate': 0.0
}, inplace=True)

In [521]:
# verify the info again
# all missing have been filled as specified by the code
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1554 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1554 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

### The provided data is denormalized 
##### The data will be converted to 1NF

In [522]:
# Convert to 1NF by atomizing the 'FullName' column
# This spllits the 'FullName' into 'first_name' and 'last_name'ArithmeticError
zulo_bank[['first_name', 'last_name']] = zulo_bank['FullName'].str.split(expand=True)

display(zulo_bank.head())

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate,first_name,last_name
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,unknown,NaN,NaN,0.00,Carol,Miller
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12,Geoffrey,Banks
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63,Geoffrey,Banks
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15,Geoffrey,Banks
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03,Geoffrey,Banks

### 1NF to 2NF is the next thing to do by seperating the columns into their respective tables and introduce primary keys

In [523]:
# slicing out the customer table

customer = zulo_bank[['first_name', 'last_name', 'Email', 'Phone']].copy().drop_duplicates().reset_index(drop=True)
customer['customer_id'] = range(1, len(customer) + 1)
customer = customer[['customer_id', 'first_name', 'last_name', 'Email', 'Phone']]

customer.head()

,customer_id,first_name,last_name,Email,Phone
0,1,Carol,Miller,yfisher@example.org,6088279027
1,2,Geoffrey,Banks,gonzalesgeorge@example.net,001-546-857-6518x5359
2,3,Eric,Phillips,mark13@example.com,(699)516-7638x82918
3,4,Paul,Noble,harrisonrachel@example.net,+1-586-758-3968x3144
4,5,Ryan,Alexander,loganjohn@example.org,900.377.1792x148

In [524]:
# slicing out the account table
account = zulo_bank[['AccountType', 'Balance', 'OpeningDate']].copy().drop_duplicates().reset_index(drop=True)
account['account_id'] = range(1, len(account) + 1)
account = account[['account_id', 'AccountType', 'Balance', 'OpeningDate']]

account

     account_id AccountType  Balance OpeningDate
0             1     Savings  5652.16  2019-08-12
1             2      Credit  2881.24  2019-05-06
2             3     Savings  2391.90  2020-09-17
3             4      Credit  7880.53  2023-08-14
4             5      Credit  3020.69  2019-08-13
..          ...         ...      ...         ...
193         194      Credit  7251.00  2022-11-18
194         195    Checking  7140.83  2019-09-23
195         196    Checking  1782.43  2020-12-24
196         197      Credit  6893.38  2021-04-22
197         198     Savings  4040.05  2023-08-24

[198 rows x 4 columns]

In [525]:
# slicing the transaction table
transaction = zulo_bank[['TransactionType', 'Amount', 'TransactionDate']].copy().drop_duplicates().reset_index(drop=True)
transaction['transaction_id'] = range(1, len(transaction) + 1)
transaction = transaction[['transaction_id', 'TransactionType', 'Amount', 'TransactionDate']]

transaction

     transaction_id TransactionType  Amount TransactionDate
0                 1      withdrawal  102.15      2023-04-26
1                 2      withdrawal  358.80      2020-06-13
2                 3         deposit  112.41      2019-05-17
3                 4         deposit  463.13      2020-09-02
4                 5      withdrawal   21.94      2022-07-03
..              ...             ...     ...             ...
995             996      withdrawal  303.30      2023-07-09
996             997         deposit  484.00      2020-12-27
997             998      withdrawal  427.36      2023-06-19
998             999      withdrawal  415.01      2022-02-09
999            1000         deposit  115.48      2021-10-16

[1000 rows x 4 columns]

In [526]:
# slicing the loan table
loan = zulo_bank[['LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate']].copy().drop_duplicates().reset_index(drop=True)
loan['loan_id'] = range(1, len(loan) + 1)
loan = loan[['loan_id', 'LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate']]

loan.head(3)

,loan_id,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,1,NaN,unknown,NaN,NaN,0.00
1,2,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,3,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63

In [527]:
# Merge operations to create the zulo Bank

zulo_bank = zulo_bank.merge(customer, on=['first_name', 'last_name', 'Email', 'Phone'], how='left')\
                     .merge(account, on=['AccountType', 'Balance', 'OpeningDate'], how='left')\
                     .merge(transaction, on=['TransactionType', 'Amount', 'TransactionDate'], how='left')\
                     .merge(loan, on=['LoanAmount', 'LoanType',	'StartDate', 'EndDate', 'InterestRate'], how='left')\
                     [['customer_id', 'account_id', 'transaction_id', 'loan_id']]

In [528]:
zulo_bank

      customer_id  account_id  transaction_id  loan_id
0               1           1               1        1
1               2           2               2        2
2               2           2               2        3
3               2           2               2        4
4               2           2               2        5
...           ...         ...             ...      ...
1549           20         165             997       29
1550           20         165             997       30
1551           25          94             998        1
1552            5          68             999       11
1553            6          76            1000       12

[1554 rows x 4 columns]

In [529]:
zulo_bank.columns

Index(['customer_id', 'account_id', 'transaction_id', 'loan_id'], dtype='object')

In [530]:
## 2NF to 3NF 
#### This is achieved by creating date_dimension table 
# Define the start dates and end dates

start_date = datetime(2020, 1, 1)
current_date = datetime(2090, 12, 31)

# calculate the number of days between start_date and current_date
num_days = (current_date - start_date).days

#Generate a list of dates from start date to current date
date_list = [start_date + timedelta(days=x) for x in range(num_days +1)]

# Ensure date_id matches the length of the date list
date = {'date_id': [x for x in range(1, len(date_list) +1)], 'date': date_list}

#create dataFrame
date_dim = pd.DataFrame(date)

date_dim['Year'] = date_dim['date'].dt.year
date_dim['Month'] = date_dim['date'].dt.month
date_dim['Day'] = date_dim['date'].dt.day
date_dim['date'] = pd.to_datetime(date_dim['date']).dt.date

In [531]:
date_dim

       date_id        date  Year  Month  Day
0            1  2020-01-01  2020      1    1
1            2  2020-01-02  2020      1    2
2            3  2020-01-03  2020      1    3
3            4  2020-01-04  2020      1    4
4            5  2020-01-05  2020      1    5
...        ...         ...   ...    ...  ...
25928    25929  2090-12-27  2090     12   27
25929    25930  2090-12-28  2090     12   28
25930    25931  2090-12-29  2090     12   29
25931    25932  2090-12-30  2090     12   30
25932    25933  2090-12-31  2090     12   31

[25933 rows x 5 columns]

In [532]:

#Account from 2NF to 3NF

# Ensure OpeningDate in 'account' and 'date' in 'date_dim' are of the same type
account['OpeningDate'] = pd.to_datetime(account['OpeningDate']).dt.date  # Convert to datetime

# Now merge on 'OpeningDate' and 'date'
account = account.merge(date_dim, left_on='OpeningDate', right_on='date', how='inner')\
                 .rename(columns={'date_id': 'OpeningDate_ID'})\
                 .reset_index(drop=True)\
                 [['account_id', 'AccountType', 'Balance', 'OpeningDate_ID']]

In [533]:
account.head(4)

   account_id AccountType  Balance  OpeningDate_ID
0           3     Savings  2391.90             261
1           4      Credit  7880.53            1322
2           6     Savings   947.43             857
3           7     Savings  4492.62             244

In [534]:
# Transaction table to 3NF

# Convert 'TransactionDate' to datetime format
transaction['TransactionDate'] = pd.to_datetime(transaction['TransactionDate']).dt.date  # Ensure it's in datetime64[ns]

# Merge with the date dimension, ensuring both sides are in datetime format
transaction = transaction.merge(date_dim, left_on='TransactionDate', right_on='date', how='inner')\
                                .rename(columns={'date_id': 'TransactionDate_ID'})\
                                .reset_index(drop=True)\
                                [['transaction_id', 'TransactionType', 'Amount', 'TransactionDate_ID']]

In [535]:
transaction.head()

   transaction_id TransactionType  Amount  TransactionDate_ID
0               1      withdrawal  102.15                1212
1             976      withdrawal  438.42                1212
2               2      withdrawal  358.80                 165
3               4         deposit  463.13                 246
4               5      withdrawal   21.94                 915

In [536]:

# Convert 'StartDate' and 'EndDate' to full datetime
loan['StartDate'] = pd.to_datetime(loan['StartDate']).dt.date
loan['EndDate'] = pd.to_datetime(loan['EndDate']).dt.date


# Merge with date dimension, ensuring both sides are in datetime format
loan = loan.merge(date_dim, left_on='StartDate', right_on='date', how='inner')\
                           .rename(columns={'date_id': 'StartDate_ID'})

# Merge again for 'EndDate' with appropriate suffixes to avoid duplicates
loan = loan.merge(date_dim, left_on='EndDate', right_on='date', how='inner', suffixes=('', '_end'))\
                           .rename(columns={'date_id': 'EndDate_ID'})

# Select desired columns and reset index
loan = loan.reset_index(drop=True)\
                          [['loan_id', 'LoanAmount', 'LoanType', 'StartDate_ID', 'EndDate_ID', 'InterestRate']]

In [537]:
loan.head()

   loan_id  LoanAmount  LoanType  StartDate_ID  EndDate_ID  InterestRate
0        2    32428.90  Mortgage           541       10966          2.12
1        3    31406.77  Personal           424        6860          4.63
2        5    27873.08      Auto           750        6364          7.03
3        6    25666.75      Auto          1225        7058          6.84
4        7    23853.85  Personal          1491        6618          7.41

In [538]:
# save to our directory

transaction.to_csv('Data Models/transaction.csv', index=False)
loan.to_csv('Data Models/loan.csv', index=False)
account.to_csv('Data Models/account.csv', index=False)
customer.to_csv('Data Models/customer.csv', index=False)
date_dim.to_csv('Data Models/date_dim.csv', index=False)
zulo_bank.to_csv('Data Models/zulo_bank.csv', index=False)

# Data warehouse Models

#### Starting with Transaction DWH Schema

# Transaction DWH

In [541]:

# Create transaction_dim DataFrame from the transaction DataFrame with unique values
transaction_dim = transaction[['transaction_id', 'TransactionType']].copy()\
                                                     .drop_duplicates()\
                                                     .reset_index(drop=True)

# Create account_dim DataFrame from the account DataFrame with unique values
account_dim = account[['account_id', 'AccountType', 'Balance', 'OpeningDate_ID']].copy()\
                                                                 .drop_duplicates()\
                                                                 .reset_index(drop=True)

# Create a fact table by merging zulo_bank with transaction and account
transaction_fact_table = zulo_bank.merge(transaction, on='transaction_id', how='inner')\
                                  .merge(account, on='account_id', how='inner')\
                                  [['transaction_id', 'account_id', 'OpeningDate_ID', 'TransactionDate_ID', 'Amount']]

# Loan DWH Schema

In [546]:
customer_dim = customer[['customer_id', 'first_name', 'last_name', 'Email', 'Phone']]\
                       .copy().drop_duplicates()\
                       .reset_index(drop=True)

loan_dim = loan[['loan_id', 'LoanType']]\
                       .copy().drop_duplicates()\
                       .reset_index(drop=True)

loan_fact_table = zulo_bank.merge(customer, on='customer_id', how='inner')\
                           .merge(loan, on='loan_id', how='inner')\
                            [['loan_id', 'customer_id', 'StartDate_ID', 'EndDate_ID', 'LoanAmount', 'InterestRate']]

In [548]:
loan_fact_table

      loan_id  customer_id  StartDate_ID  EndDate_ID  LoanAmount  InterestRate
0           2            2           541       10966    32428.90          2.12
1           2            2           541       10966    32428.90          2.12
2           2            2           541       10966    32428.90          2.12
3           2            2           541       10966    32428.90          2.12
4           2            2           541       10966    32428.90          2.12
...       ...          ...           ...         ...         ...           ...
1023      127           86          1146        5099     6815.56          2.90
1024      128           86           665       12396    15095.53          4.58
1025      128           86           665       12396    15095.53          4.58
1026      130           86          1291       10442    33481.52          5.06
1027      130           86          1291       10442    33481.52          5.06

[1028 rows x 6 columns]

In [552]:
# save to memory
# Save DataFrames to CSV with the appropriate file paths
transaction_dim.to_csv(r'Data Models/transaction_DWH/transaction_dim.csv', index=False)
account_dim.to_csv(r'Data Models/transaction_DWH/account_dim.csv', index=False)
transaction_fact_table.to_csv(r'Data Models/transaction_DWH/transaction_fact_table.csv', index=False)

customer_dim.to_csv(r'Data Models/loan_DWH/customer_dim.csv', index=False)
loan_dim.to_csv(r'Data Models/loan_DWH/loan_dim.csv', index=False)
loan_fact_table.to_csv(r'Data Models/loan_DWH/loan_fact_table.csv', index=False)

# Loading into RDBMS using Psycopg2

In [553]:
!pip install psycopg2

Collecting psycopg2
  Using cached psycopg2-2.9.9.tar.gz (384 kB)
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: psycopg2
  Building wheel for psycopg2 (setup.py) ... done
  Created wheel for psycopg2: filename=psycopg2-2.9.9-cp311-cp311-macosx_10_9_x86_64.whl size=133295 sha256=e82c2689586897f32424c483f734f88151634211df1c7f59c84522b92eaa02d6
  Stored in directory: /Users/villy/Library/Caches/pip/wheels/ab/34/b9/78ebef1b3220b4840ee482461e738566c3c9165d2b5c914f51
Successfully built psycopg2
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.9

### Testing Database Connection

In [609]:
import psycopg2
import psycopg2.errors

# create a function to test connection 
def test_connection(): 

        try:
            
            
            # Connect to the PostgreSQL database
            connection = psycopg2.connect(
                user="ridwanclouds",
                password="password",
                host="localhost",
                port="5432",
                database="postgres"
            )

            # Enable automatic commit
            connection.autocommit = True

            # Create a cursor object
            cursor = connection.cursor()

            # Execute a SQL query
            cursor.execute("SELECT version();")
            record = cursor.fetchone()
            print("You are connected to Postgres RDBMS ", record, "\n")

            # Close connection and cursor
            cursor.close()
            connection.close()

        except (Exception, Error) as error:
            print("Error while connecting to PostgreSQL", error)

test_connection()

You are connected to Postgres RDBMS  ('PostgreSQL 16.2 on x86_64-apple-darwin20.6.0, compiled by Apple clang version 12.0.5 (clang-1205.0.22.9), 64-bit',)

#### Create a database called 'zulo_bank'

In [607]:
import psycopg2
from psycopg2 import Error

# Define database connection parameters
db_params = {
    'username': 'ridwanclouds',
    'password': 'password',
    'host': 'localhost',
    'port': '5432',
    'database': 'zulo_bank'  
}

# Define the connection URL
default_db_url = f"postgresql://{db_params['username']}:{db_params['password']}@{db_params['host']}:{db_params['port']}/postgres"

# Connect to the PostgreSQL database
try:
    connection = psycopg2.connect(default_db_url)
    connection.autocommit = True  # Enable automatic commit
    cursor = connection.cursor()  # Create a cursor object

    # Test the connection by getting the PostgreSQL version
    cursor.execute(f"CREATE DATABASE {db_params['database']};")
   
    print(f"Database {db_params['database']} created successfully:", record)

    # Additional operations can go here

    cursor.close()  # Close cursor
    connection.close()  # Close connection

except (psycopg2.Error, Exception) as error:
    # Handle errors with detailed information
    print(error)

Database zulo_bank created successfully: ('PostgreSQL 16.2 on x86_64-apple-darwin20.6.0, compiled by Apple clang version 12.0.5 (clang-1205.0.22.9), 64-bit',)

In [657]:
# Connect to the 'zulo_bank' just created

def zulo_connection():
    connection = psycopg2.connect(
        host='localhost',
        database='zulo_bank',
        user='ridwanclouds',
        password='password'
    )
    return connection
conn = zulo_connection()

In [658]:
zulo_connection()

In [661]:

# Define a function to create schema and tables
def create_tables():
    # Connect to the PostgreSQL database
    conn = zulo_connection()
    cursor = conn.cursor()

    # SQL script to create schema and tables
    create_table_query = '''
    -- Create schema if it doesn't exist
    CREATE SCHEMA IF NOT EXISTS zulobankdb;

    -- Drop tables if they exist
    DROP TABLE IF EXISTS zulobankdb.transaction CASCADE;
    DROP TABLE IF EXISTS zulobankdb.account CASCADE;
    DROP TABLE IF EXISTS zulobankdb.customer CASCADE;
    DROP TABLE IF EXISTS zulobankdb.date_dim CASCADE;
    DROP TABLE IF EXISTS zulobankdb.loan CASCADE;
    DROP TABLE IF EXISTS zulobankdb.zulobankdb_fact CASCADE;

    -- Create date dimension table
    CREATE TABLE IF NOT EXISTS zulobankdb.date_dim (
        date_id SERIAL PRIMARY KEY,
        date DATE,
        Year INTEGER,
        Month INTEGER,
        Day INTEGER
    );

    -- Create transaction table
    CREATE TABLE IF NOT EXISTS zulobankdb.transaction (
        transaction_id SERIAL PRIMARY KEY,
        TransactionType VARCHAR(50),
        Amount FLOAT,
        TransactionDate_ID INTEGER,
        FOREIGN KEY (TransactionDate_ID) REFERENCES zulobankdb.date_dim(date_id)
    );

    -- Create account table
    CREATE TABLE IF NOT EXISTS zulobankdb.account (
        account_id SERIAL PRIMARY KEY,
        AccountType VARCHAR(50),
        Balance FLOAT,
        OpeningDate_ID INTEGER,
        FOREIGN KEY (OpeningDate_ID) REFERENCES zulobankdb.date_dim(date_id)
    );

    -- Create customer table
    CREATE TABLE IF NOT EXISTS zulobankdb.customer (
        customer_id SERIAL PRIMARY KEY,
        first_name VARCHAR(100),
        last_name VARCHAR(100),
        Email VARCHAR(255),
        Phone VARCHAR(50)
    );

    -- Create loan table
    CREATE TABLE IF NOT EXISTS zulobankdb.loan (
        loan_id SERIAL PRIMARY KEY,
        customer_id INTEGER,
        LoanAmount FLOAT,
        LoanType VARCHAR(50),
        StartDate_ID INTEGER,
        EndDate_ID INTEGER,
        InterestRate FLOAT,
        FOREIGN KEY (customer_id) REFERENCES zulobankdb.customer(customer_id),
        FOREIGN KEY (StartDate_ID) REFERENCES zulobankdb.date_dim(date_id),
        FOREIGN KEY (EndDate_ID) REFERENCES zulobankdb.date_dim(date_id)
    );

    -- Create fact table
    CREATE TABLE IF NOT EXISTS zulobankdb.zulobankdb_fact (
        customer_id INTEGER,
        account_id INTEGER,
        transaction_id INTEGER,
        loan_id INTEGER,
        FOREIGN KEY (customer_id) REFERENCES zulobankdb.customer(customer_id),
        FOREIGN KEY (account_id) REFERENCES zulobankdb.account(account_id),
        FOREIGN KEY (transaction_id) REFERENCES zulobankdb.transaction(transaction_id),
        FOREIGN KEY (loan_id) REFERENCES zulobankdb.loan(loan_id)
    );
    '''

    # Execute the SQL script to create schema and tables
    cursor.execute(create_table_query)
    conn.commit()  # Commit the changes
    # close connection
    cursor.close()
    conn.close()

# Call the function to create schema and tables
create_tables()

#

# Load data into the 'zulo_bank' database

In [666]:
# Create a function to load the data into the database 
# date_dim table
import csv
csv_path = r'Data Models/date_dim.csv'

def load_data_from_csv(csv_path):
    conn = zulo_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r') as file:
        reader = csv.reader(file)
        next(reader) # to avoid the header of the csv 
        for row in reader:
            cursor.execute(
                '''INSERT INTO zulobankdb.date_dim (date_id, date, Year, Month, Day)
                   VALUES (%s, %s, %s, %s, %s); ''', row
            )
    conn.commit()
    cursor.close()
    conn.close()

load_data_from_csv(csv_path)
print('dim_date data loaded successfully')